ExprovipFuel/src/Catalogs/Настройки/Настройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Настройки</name>
  <predefined>
    <items>
      <name>ПредопределенныеНастройки</name>
      <description>Предопределенные настройки</description>
    </items>
  </predefined>
  <attributes>
    <name>EUR</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>USD</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>RUB</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>BYN</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьДляВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьДляВыгрузкиИнвойсов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьДляКопийФактур</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьВыгрузкиДляСайта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>APIСайтДляВыгрузкиДанных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>APIРесурсВыгрузкиКлиентов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>APIРесурсВыгрузкиОплат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>APIРесурсВыгрузкиФактуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>APIРесурсВыгрузкиБаланса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ExprovipFuel/src/Catalogs/Настройки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить настройки.
// 
// Возвращаемое значение:
//  Структура - Получить настройки:
// * EUR - СправочникСсылка.Валюты - 
// * USD - СправочникСсылка.Валюты - 
// * RUB - СправочникСсылка.Валюты - 
// * BYN - СправочникСсылка.Валюты - 
// * ПутьДляВыгрузки - Строка - 
// * ПутьДляВыгрузкиИнвойсов - Строка - 
// * ПутьДляКопийФактур - Строка - 
// * ПутьВыгрузкиДляСайта - Строка - 
// * APIСайтДляВыгрузкиДанных - Строка -
// * APIРесурсВыгрузкиКлиентов - Строка -
// * APIРесурсВыгрузкиОплат - Строка -
// * APIРесурсВыгрузкиФактуры - Строка -
// * APIРесурсВыгрузкиБаланса - Строка -
Функция ПолучитьНастройки() Экспорт
	Структура = Новый Структура;
	Структура.Вставить("EUR", Справочники.Валюты.ПустаяСсылка());
	Структура.Вставить("USD", Справочники.Валюты.ПустаяСсылка());
	Структура.Вставить("RUB", Справочники.Валюты.ПустаяСсылка());
	Структура.Вставить("BYN", Справочники.Валюты.ПустаяСсылка());
	Структура.Вставить("ПутьДляВыгрузки", "");
	Структура.Вставить("ПутьДляВыгрузкиИнвойсов", "");
	Структура.Вставить("ПутьДляКопийФактур", "");
	Структура.Вставить("ПутьВыгрузкиДляСайта", "");
	Структура.Вставить("APIСайтДляВыгрузкиДанных", "");
	Структура.Вставить("APIРесурсВыгрузкиКлиентов", "");
	Структура.Вставить("APIРесурсВыгрузкиОплат", "");
	Структура.Вставить("APIРесурсВыгрузкиФактуры", "");
	Структура.Вставить("APIРесурсВыгрузкиБаланса", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Настройки.EUR КАК EUR,
	|	Настройки.USD КАК USD,
	|	Настройки.RUB КАК RUB,
	|	Настройки.BYN КАК BYN,
	|	Настройки.ПутьДляВыгрузки КАК ПутьДляВыгрузки,
	|	Настройки.ПутьДляВыгрузкиИнвойсов КАК ПутьДляВыгрузкиИнвойсов,
	|	Настройки.ПутьДляКопийФактур КАК ПутьДляКопийФактур,
	|	Настройки.ПутьВыгрузкиДляСайта КАК ПутьВыгрузкиДляСайта,
	|	Настройки.APIСайтДляВыгрузкиДанных КАК APIСайтДляВыгрузкиДанных,
	|	Настройки.APIРесурсВыгрузкиКлиентов КАК APIРесурсВыгрузкиКлиентов,
	|	Настройки.APIРесурсВыгрузкиОплат КАК APIРесурсВыгрузкиОплат,
	|	Настройки.APIРесурсВыгрузкиФактуры КАК APIРесурсВыгрузкиФактуры,
	|	Настройки.APIРесурсВыгрузкиБаланса КАК APIРесурсВыгрузкиБаланса
	|ИЗ
	|	Справочник.Настройки КАК Настройки
	|ГДЕ
	|	Настройки.Ссылка = ЗНАЧЕНИЕ(Справочник.Настройки.ПредопределенныеНастройки)";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Структура, Выборка);
	КонецЕсли;
	
	Возврат Структура;
КонецФункции

#КонецОбласти

#КонецЕсли
